jorgebucaran/fish-bax
jethrokuan/z
ilancosman/tide@v6
patrickf1/fzf.fish
plttn/fish-eza
jhillyerd/plugin-git
gazorby/fish-exa
jorgebucaran/nvm.fish
oh-my-fish/plugin-aws
catppuccin/fish
